Task 1.Python Programming

Task 1.1 Implenment drawPyramit(int n)

In [ ]:
def drawPyramid(n):
  for i in range (1, n + 1):
    space = ' ' * (n - i)
    x = 'X' * (2 * i - 1)
    print(space + x)
drawPyramid(3)

  X
 XXX
XXXXX

Task 1.2

In [ ]:
from enum import Enum
from datetime import datetime

class TransactionType(Enum):
  DEPOSIT = 'Deposit'
  WITHDRAWAL = 'Withdrawal'
  TRANSFER = 'Transfer'

class Transaction:
  transaction_counter = 1
  def __init__(self, trans_type, amount):
    self.id = Transaction.transaction_counter
    Transaction.transaction_counter =+ 1
    self.type = trans_type
    self.date = datetime.now()
    self.amount = amount
  def __repr__(self):
    return f'Transaction(ID={self.id}, Type={self.type.value}, Amount={self.amount}, Date={self.date})'

class Account:
  def __init__(self, account_no, owner, initial_balance):
    self.account_no = account_no
    self.owner = owner
    self.balance = initial_balance
    self.transactions = []

  def deposit(self, amount):
    if amount > 0:
      self.balance += amount
      self.transactions.append(Transaction(TransactionType.DEPOSIT, amount))

  def withdrawal(self, amount):
    if amount > 0 and amount <= self.balance:
      self.balance -= amount
      self.transactions.append(Transaction(TransactionType.WITHDRAWAL, amount))

  def transfer(self, to_account, amount):
    if amount > 0 and amount <= self.balance:
      self.withdrawal(amount)
      to_account.deposit(amount)
      self.transactions.append(Transaction(TransactionType.TRANSFER, amount))

  def __repr__(self):
    return f'Account(Account No={self.account_no}, Owner={self.owner}, Balance={self.balance})'

In [ ]:
# 1.2 a
def countDepositTransaction(self):
  return sum(1 for t in self.transactions if t.type == TransactionType.DEPOSIT)

# 1.2. b
def findMaxWithdrawalTransaction(self):
  withDrawals = [t for t in self.transactions if t.type == TransactionType.WITHDRAWAL]
  return max(withDrawals, key=lambda t: t.amount)

# 1.2 c
def statByTypes(self):
  stats = {t_type : 0 for t_type in TransactionType}
  for t in self.transactions:
    stats[t.type] += 1
  return stats

# 1.2 d
def filterTransaction(self, threshold):
  return sorted(
        [t for t in self.transactions if t.type == TransactionType.TRANSFER and t.amount > threshold],
        key=lambda t: t.amount
      )

In [ ]:
# test
acc1 = Account('1', 'A', 1000)
acc2 = Account('2', 'B', 500)

acc1.deposit(200)
acc1.deposit(1000)
acc1.deposit(100)
acc2.deposit(100)
acc1.transfer(acc2, 100)
acc1.transfer(acc2, 200)
acc1.transfer(acc2, 300)

acc1.withdrawal(100)
acc1.withdrawal(400)
acc1.withdrawal(200)

print(acc1)
print(acc2)

print('a: ', countDepositTransaction(acc1))
print('b: ', findMaxWithdrawalTransaction(acc1))
print('c: ', statByTypes(acc1))
print('d: ', filterTransaction(acc1, 100))

Account(Account No=1, Owner=A, Balance=1000)
Account(Account No=2, Owner=B, Balance=1200)
a:  3
b:  Transaction(ID=1, Type=Withdrawal, Amount=400, Date=2025-03-10 07:06:38.549207)
c:  {<TransactionType.DEPOSIT: 'Deposit'>: 3, <TransactionType.WITHDRAWAL: 'Withdrawal'>: 6, <TransactionType.TRANSFER: 'Transfer'>: 3}
d:  [Transaction(ID=1, Type=Transfer, Amount=200, Date=2025-03-10 07:06:38.549132), Transaction(ID=1, Type=Transfer, Amount=300, Date=2025-03-10 07:06:38.549161)]

Task 2 Numpy

Task 2.1

In [ ]:
import numpy as np
a = np.array([1, 2, 6, 7, 8, 9, 10])
b = np.array([1, 8, 9, 10, 3, 4, 5])

common_items = np.intersect1d(a, b)
print(common_items)

[ 1  8  9 10]

Task 2.2

In [ ]:
def is_prime_number(n):
  if n < 2:
    return False
  for i in range(2, int(np.sqrt(n)) + 1):
    if n % i == 0:
      return False
  return True

numbers_generate = np.arange(1, 101)
prime_numbers = numbers_generate[np.vectorize(is_prime_number)(numbers_generate)]


print(prime_numbers)

[ 2  3  5  7 11 13 17 19 23 29 31 37 41 43 47 53 59 61 67 71 73 79 83 89
 97]

Task 3 Pandas

Task 3.1

In [ ]:
from os import PRIO_USER
import pandas as pd

df = pd.read_csv('data/users.csv')

# print(df)

# a
print('\na:\n ', df.tail(10))

# b
print('\nb:\n ',df.shape)

# c
print('\nc:\n ', df.columns.to_list())

# d
print('\nd:\n ', df.dtypes)

# e
print('\ne:\n ', df['occupation'].unique())

# f
print('\nf:\n ', df['occupation'].mode()[0])

a:
       user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator     2215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

b:
  (943, 5)

c:
  ['user_id', 'age', 'gender', 'occupation', 'zip_code']

d:
  user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

e:
  ['technician' 'other' 'writer' 'executive' 'administrator' 'student'
 'lawyer' 'educator' 'scientist' 'entertainment' 'programmer' 'librarian'
 'homemaker' 'artist' 'engineer' 'marketing' 'none' 'healthcare' 'retired'
 'salesman' 'doctor']

f:
  student

In [ ]:
# g
print('\ng:\n ', df.describe(include='all'))

# h
print('\nh:\n ', df.groupby('occupation')['age'].mean())

# i
def male_ratio(n):
  return (n == 'M').sum() / len(n)
male_ratio_occupation = df.groupby('occupation')['gender'].apply(male_ratio)
male_ratio_occupation_sorted = male_ratio_occupation.sort_values(ascending=False)
print('\ni:\n', male_ratio_occupation_sorted)

# j
print('\nj:\n', df.groupby('occupation')['age'].agg(['min', 'max']))

# k
print('\nk:\n', df.groupby(['occupation', 'gender'])['age'].mean())

# l
gender_count = df.groupby(['occupation', 'gender']).size().unstack()
gender_percentage = gender_count.div(gender_count.sum(axis=1), axis=0) * 100
print('\nl:\n', gender_percentage)

g:
             user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

h:
  occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

i:
 occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
Name: gender, dtype: float64

j:
                min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

k:
 occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

l:
 gender                 F           M
occupation
administrator  45.569620   54.430380
artist         46.428571   53.571429
doctor               NaN  100.000000
educator       27.368421   72.631579
engineer        2.985075   97.014925
entertainment  11.111111   88.888889
executive       9.375000   90.625000
healthcare     68.750000   31.250000
homemaker      85.714286   14.285714
lawyer         16.666667   83.333333
librarian      56.862745   43.137255
marketing      38.461538   61.538462
none           44.444444   55.555556
other          34.285714   65.714286
programmer      9.090909   90.909091
retired         7.142857   92.857143
salesman       25.000000   75.000000
scientist       9.677419   90.322581
student        30.612245   69.387755
technician      3.703704   96.296296
writer         42.222222   57.777778

Task 3.2

In [ ]:
df_cars = pd.read_csv('data/cars.csv')

# print(df_cars)

# a
most_expensive_company = df_cars.loc[df_cars['price'].idxmax(), 'company']
print('\na:\n ', most_expensive_company)

# b
print('\nb:\n ', df_cars[df_cars['company'] == 'toyota'])

# c
print('\nc:\n ', df_cars['company'].value_counts())

a:
  mercedes-benz

b:
      index company body-style  wheel-base  length engine-type num-of-cylinders  \
48     66  toyota  hatchback        95.7   158.7         ohc             four
49     67  toyota  hatchback        95.7   158.7         ohc             four
50     68  toyota  hatchback        95.7   158.7         ohc             four
51     69  toyota      wagon        95.7   169.7         ohc             four
52     70  toyota      wagon        95.7   169.7         ohc             four
53     71  toyota      wagon        95.7   169.7         ohc             four
54     79  toyota      wagon       104.5   187.8        dohc              six

    horsepower  average-mileage    price
48          62               35   5348.0
49          62               31   6338.0
50          62               31   6488.0
51          62               31   6918.0
52          62               27   7898.0
53          62               27   8778.0
54         156               19  15750.0

c:
  company
toyota           7
bmw              6
mazda            5
nissan           5
audi             4
mercedes-benz    4
mitsubishi       4
volkswagen       4
alfa-romero      3
chevrolet        3
honda            3
isuzu            3
jaguar           3
porsche          3
dodge            2
volvo            2
Name: count, dtype: int64

In [ ]:
# d
print('\nd:\n ', df_cars.groupby('company')['price'].max())

# e
print('\ne:\n ', df_cars.groupby('company')['average-mileage'].mean())

d:
  company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

e:
  company
alfa-romero      20.333333
audi             20.000000
bmw              19.000000
chevrolet        41.000000
dodge            31.000000
honda            26.333333
isuzu            33.333333
jaguar           14.333333
mazda            28.000000
mercedes-benz    18.000000
mitsubishi       29.500000
nissan           31.400000
porsche          17.000000
toyota           28.714286
volkswagen       31.750000
volvo            23.000000
Name: average-mileage, dtype: float64

In [ ]:

# f
print('\nf:\n ', df_cars.sort_values(by='price', ascending=True))

f:
      index        company body-style  wheel-base  length engine-type  \
13     16      chevrolet  hatchback        88.4   141.1           l
27     36          mazda  hatchback        93.1   159.1         ohc
48     66         toyota  hatchback        95.7   158.7         ohc
36     49     mitsubishi  hatchback        93.7   157.3         ohc
28     37          mazda  hatchback        93.1   159.1         ohc
..    ...            ...        ...         ...     ...         ...
11     14            bmw      sedan       103.5   193.8         ohc
35     47  mercedes-benz    hardtop       112.0   199.2        ohcv
22     31          isuzu      sedan        94.5   155.9         ohc
23     32          isuzu      sedan        94.5   155.9         ohc
47     63        porsche  hatchback        98.4   175.7       dohcv

   num-of-cylinders  horsepower  average-mileage    price
13            three          48               47   5151.0
27             four          68               30   5195.0
48             four          62               35   5348.0
36             four          68               37   5389.0
28             four          68               31   6095.0
..              ...         ...              ...      ...
11              six         182               16  41315.0
35            eight         184               14  45400.0
22             four          70               38      NaN
23             four          70               38      NaN
47            eight         288               17      NaN

[61 rows x 10 columns]